package Lessons.Lesson10.Comments;

public class Comments {
    //Существуют 3 вида комментариев:

    //end-of-line (//) действуют до конца строки.

    // multiline: "/*" - начало,конец -  "*/"
    /* Используется для написания комментариев на несколько строк,
    * для красоты в начале каждой строки используют "*"
    * это не обязательно,а просто красивее
    *
                         */


    //JavaDoc (/** -начало, конец  - */) - это специальный tool, составная часть JDk. Помогает описывать класс,то есть
    //если мы захотим сохранить и распечатать наш класс в каком-то понятном виде ,мы можем писать в этом классе JavaDoc
    //комментарии и затем с помощью JavaDoc Tool мы можем сохранить документ об этом классе. Формат документа: html.

}
