package Lessons.Lesson27.Exceptions.Class_Hierarchy;

public class Test1 {
//* Обработка исключений позволяет нам разграничивать код на код, который должен выполняться при обычном протекании
// программы и код, который должен выполняться при выбросе исключений.

//*Иерархия классов.
//    Иерархия классов.
//                                       Object
//                                          |
//                                          |
//                                      Throwable
//                                  |                 |
//       RuntimeException  ---- Exception           Error
//       |    |    |           |    |    |       |    |    |
//      /…\  /…\  /…\         /…\  /…\  /…\     /…\  /…\  /…\

}
