package Lessons.Lesson26.Non_Access_Modifier;

public class Test {
//* Non-access modifiers:

//*transient. Переменные класса с ключевым словом transient не сериализуются.

//*native. Методы с ключевым словом native реализованны не на Java. В своём описании они не имеют тела и заканчиваются
// как абстрактные методы символом «;»

//*synchronized. Методы с ключевым словом synchronized могут быть использованны в одно и то же время только одним потоком.

//*volatile. Переменные с ключевым словом volatile могут быть изменены разными потоками и данные изменения будут
// видны во всех потоках.

//*strictfp. Ключевое слово strictfp в методах и классах ограничивает точность вычеслений с float и double
// по стандарту IEEE.
}
