package Lessons.Lesson19;

public class Comand_line_arguments {
//  Командные аргументы - это аргументы,которые мы можем задавать когда мы запускаем программу. То есть при её запуске.
//Благодрая массиву,который есть в методе main мы и можем использовать Командные аргументы.
//Все аргументы  Command line arguments являются String;

//    Чтобы подтвердить это, введите следующую команду:
//    $ javac -version
// ( Инструмент командной строки Javac используется для компиляции программ Java)
//
//    Если Инструмент командной строки Javac недоступен в нашей  системе.
//    Давайте воспользуемся командой default-jdk, чтобы получить это:
//    $ sudo apt install default-jdk
//
//    Чтобы проверить установку javac , введите:
//    $ javac -version
//
//    Теперь напишите программу на Java в текстовом файле и сохраните ее с расширением .java .
//    Предположим, я создал файл с именем « testing.java » и написал в нем простую программу:
//
//    testing.java
//    class testing {
//        public static void main(String args[]) {
//            System. out. println("Привет! Добро пожаловать в блог AndreyEx");
//        }
//    }

//(Имейте в виду, что имя вашего класса должно совпадать с именем файла)
//    Скомпилируйте файл testing.java на терминале с помощью команды javac :
//    $ javac testing.java
//
//    Теперь запустите программу Java, вызвав ее имя класса в терминале:
//    $ java testing
}


